tutorials/verificationAndValidation/turbulentInflow/PCF/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

// ReTau = uTau delta / nuFluid
// ReTau = 395 [-]
// delta = half channel height = 1 [m]
// -> nuFluid = 1*1/395 = 2.532e-3 [m2/s]

nu              2.532e-3;


// ************************************************************************* //
